src/main/resources/xml/accommodationSalesServicePort/createComments/createComments.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sal="http://sales.accommodation.transferobject.booking.dreams.wdw.com">
   <soapenv:Header/>
   <soapenv:Body>
      <sal:createComments>
         <request>
            <!--Zero or more repetitions:-->
            <parentIds>?</parentIds>
            <!--Zero or more repetitions:-->
            <commentsInfo>
               <!--Optional:-->
               <isActive>?</isActive>
               <!--Optional:-->
               <sendToGSR>?</sendToGSR>
               <!--Optional:-->
               <confidential>?</confidential>
               <!--Optional:-->
               <profileId>?</profileId>
               <!--Optional:-->
               <profileCode>?</profileCode>
               <!--Optional:-->
               <commentId>?</commentId>
               <!--Optional:-->
               <commentText>?</commentText>
               <!--Optional:-->
               <commentLevel>?</commentLevel>
               <!--Optional:-->
               <commentOwnerDetail>
                  <!--Optional:-->
                  <tcId>?</tcId>
                  <!--Optional:-->
                  <tpsId>?</tpsId>
                  <!--Optional:-->
                  <tpId>?</tpId>
               </commentOwnerDetail>
               <!--Optional:-->
               <auditDetail>
                  <!--Optional:-->
                  <createdBy>?</createdBy>
                  <!--Optional:-->
                  <createdDate>?</createdDate>
                  <!--Optional:-->
                  <updatedBy>?</updatedBy>
                  <!--Optional:-->
                  <updatedDate>?</updatedDate>
                  <!--Optional:-->
                  <status>?</status>
               </auditDetail>
               <!--Optional:-->
               <commentType>?</commentType>
            </commentsInfo>
            <!--Optional:-->
            <roomExternalReference>
               <!--Optional:-->
               <externalReferenceType>?</externalReferenceType>
               <!--Optional:-->
               <externalReferenceCode>?</externalReferenceCode>
               <!--Optional:-->
               <externalReferenceNumber>?</externalReferenceNumber>
               <!--Optional:-->
               <externalReferenceSource>?</externalReferenceSource>
            </roomExternalReference>
            <!--Optional:-->
            <tpsExternalReference>
               <!--Optional:-->
               <externalReferenceType>?</externalReferenceType>
               <!--Optional:-->
               <externalReferenceCode>?</externalReferenceCode>
               <!--Optional:-->
               <externalReferenceNumber>?</externalReferenceNumber>
               <!--Optional:-->
               <externalReferenceSource>?</externalReferenceSource>
            </tpsExternalReference>
         </request>
         <serviceContext>
            <addressRole>?</addressRole>
            <conversationId>?</conversationId>
            <messageId>?</messageId>
            <party1Id>?</party1Id>
            <party1Type>?</party1Type>
            <party2Id>?</party2Id>
            <party2Type>?</party2Type>
            <pathHostName>?</pathHostName>
            <pathId>?</pathId>
            <principalId>?</principalId>
            <principalMethod>?</principalMethod>
            <principalRole>?</principalRole>
            <principalUri>?</principalUri>
            <principalValue>?</principalValue>
            <requestTimeStamp>?</requestTimeStamp>
            <toAddressRole>?</toAddressRole>
            <userName>?</userName>
         </serviceContext>
      </sal:createComments>
   </soapenv:Body>
</soapenv:Envelope>